In [ ]:
import os

def scale_input_data(scale_factor):
  file_bases = ['./input/application_train']
  for file_base in file_bases:
    import pandas as pd
    import shutil
    if scale_factor == 1.0:
      shutil.copyfile(file_base + '.csv', file_base + '.scaled.csv')
      continue
    df_to_scale = pd.read_csv(file_base + '.csv')
    new_num_rows = int(scale_factor * len(df_to_scale))
    if scale_factor <= 1.0:
      df_to_scale = df_to_scale.iloc[:new_num_rows]
    else:
      while len(df_to_scale) < new_num_rows:
        df_to_scale = pd.concat([df_to_scale, df_to_scale[:min(new_num_rows - len(df_to_scale), len(df_to_scale))]])
    df_to_scale.to_csv(file_base + '.scaled.csv', index=False)

if 'INPUT_SCALE_FACTOR' in os.environ:
  scale_input_data(float(os.environ['INPUT_SCALE_FACTOR']))

In [1]:
# import pandas as pd
exec(os.environ['IREWR_IMPORTS'])
import numpy as np
# ALEX: remove ML code, plotting
# from sklearn.preprocessing import LabelEncoder
# from sklearn.model_selection import train_test_split
# from sklearn.ensemble import RandomForestClassifier
# import matplotlib.pyplot as plt
# %matplotlib inline
# import seaborn as sns
# plt.style.use('bmh')
# plt.style.use('ggplot')
# plt.rcParams['figure.figsize'] = 20, 10

In [2]:
def nullremove(df):
    for i in range(0,len(df.columns)):
        print(i)

In [3]:
def descr(df):
    print(df.describe().round())

In [4]:
app=pd.read_csv("./input/application_train.scaled.csv")

In [5]:
print(app.shape)

(307511, 122)

In [6]:
application=app.copy()
print(application.shape)

(307511, 122)

In [7]:
application_object=application.select_dtypes("object")
print(application_object.shape)
print(application_object.columns)

(307511, 16)
Index(['NAME_CONTRACT_TYPE', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY',
       'NAME_TYPE_SUITE', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'OCCUPATION_TYPE',
       'WEEKDAY_APPR_PROCESS_START', 'ORGANIZATION_TYPE', 'FONDKAPREMONT_MODE',
       'HOUSETYPE_MODE', 'WALLSMATERIAL_MODE', 'EMERGENCYSTATE_MODE'],
      dtype='object')

In [8]:
application_object_columns=application_object.columns.tolist()
application_columns=application.columns.tolist()
print(len(application_object_columns))
print(len(application_columns))

16
122

In [9]:
app_if = list(set(application_columns) - set(application_object_columns))
print(len(app_if))

106

In [10]:
app_df=application[app_if]

print(app_df.shape)

(307511, 106)

In [11]:
app_df.dtypes

DAYS_ID_PUBLISH                   int64
LIVINGAREA_MODE                 float64
LIVINGAREA_MEDI                 float64
FLAG_DOCUMENT_8                   int64
SK_ID_CURR                        int64
                                 ...
FLAG_DOCUMENT_21                  int64
YEARS_BEGINEXPLUATATION_MODE    float64
REGION_RATING_CLIENT              int64
FLAG_DOCUMENT_5                   int64
LIVINGAPARTMENTS_MODE           float64
Length: 106, dtype: object

In [12]:
def nullremove(df,percentage):
   # print(len(df))
    wantedcolumnlist=[]
    columnlist=df.columns.tolist()
    #print(len(columnlist))
    for i in range(len(columnlist)):
        columnname=columnlist[i]
        nan_rows = df[columnname].isnull().sum()
     #   print(i,nan_rows)
        nullcount=(nan_rows/len(df))*100
        #print(nullcount)
        if nullcount>percentage:
            print(columnname) 
        else:
            wantedcolumnlist.append(columnname)    
        
    df=df[wantedcolumnlist]
    return df

In [13]:
#app_df=nullremove(app_df,80)

In [14]:
app_df.isna().sum()

DAYS_ID_PUBLISH                      0
LIVINGAREA_MODE                 154350
LIVINGAREA_MEDI                 154350
FLAG_DOCUMENT_8                      0
SK_ID_CURR                           0
                                 ...
FLAG_DOCUMENT_21                     0
YEARS_BEGINEXPLUATATION_MODE    150007
REGION_RATING_CLIENT                 0
FLAG_DOCUMENT_5                      0
LIVINGAPARTMENTS_MODE           210199
Length: 106, dtype: int64

In [15]:
app_df['DAYDIFF']=abs(app_df['DAYS_BIRTH'])-abs(app_df['DAYS_EMPLOYED'])

/tmp/ipykernel_25749/3680703627.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  app_df['DAYDIFF']=abs(app_df['DAYS_BIRTH'])-abs(app_df['DAYS_EMPLOYED'])

In [16]:
app_df=app_df[app_df['DAYDIFF']>0]

In [17]:
print(app_df.shape)

(252137, 107)

In [18]:
def meansep(df):
    highermean=pd.DataFrame()
    lowermean=pd.DataFrame()
    columns=df.columns.tolist()
    for i in range(len(columns)):
        mean=df[columns[i]].mean()
        if mean>10:
            highermean[columns[i]]=df[columns[i]]
        else:
            if columns[i]=='DAYS_BIRTH' or columns[i]=='DAYS_EMPLOYED' or columns[i]=='TARGET':
                highermean[columns[i]]=df[columns[i]]
            else:
                lowermean[columns[i]]=df[columns[i]]
    return highermean,lowermean

In [19]:
app_dff=app_df.copy()

In [20]:
app_dff.isna().sum()

DAYS_ID_PUBLISH                      0
LIVINGAREA_MODE                 125913
LIVINGAREA_MEDI                 125913
FLAG_DOCUMENT_8                      0
SK_ID_CURR                           0
                                 ...
YEARS_BEGINEXPLUATATION_MODE    122341
REGION_RATING_CLIENT                 0
FLAG_DOCUMENT_5                      0
LIVINGAPARTMENTS_MODE           172064
DAYDIFF                              0
Length: 107, dtype: int64

In [21]:
app_dff=nullremove(app_dff,50)

ELEVATORS_MODE
NONLIVINGAREA_AVG
NONLIVINGAPARTMENTS_AVG
BASEMENTAREA_MEDI
LANDAREA_MODE
COMMONAREA_MODE
COMMONAREA_MEDI
APARTMENTS_AVG
BASEMENTAREA_MODE
NONLIVINGAPARTMENTS_MODE
YEARS_BUILD_AVG
YEARS_BUILD_MEDI
LIVINGAPARTMENTS_AVG
OWN_CAR_AGE
ELEVATORS_MEDI
NONLIVINGAREA_MODE
FLOORSMIN_MODE
LANDAREA_MEDI
BASEMENTAREA_AVG
FLOORSMIN_AVG
ENTRANCES_MEDI
NONLIVINGAREA_MEDI
EXT_SOURCE_1
ENTRANCES_AVG
APARTMENTS_MODE
YEARS_BUILD_MODE
LANDAREA_AVG
NONLIVINGAPARTMENTS_MEDI
LIVINGAPARTMENTS_MEDI
ELEVATORS_AVG
ENTRANCES_MODE
APARTMENTS_MEDI
COMMONAREA_AVG
FLOORSMIN_MEDI
LIVINGAPARTMENTS_MODE

In [22]:
hdf,ldf=meansep(app_dff)
print(hdf.shape,ldf.shape)

(252137, 10) (252137, 62)

In [23]:
hdf.isna().sum()

SK_ID_CURR                   0
AMT_GOODS_PRICE            256
AMT_CREDIT                   0
AMT_ANNUITY                 12
TARGET                       0
HOUR_APPR_PROCESS_START      0
DAYS_EMPLOYED                0
AMT_INCOME_TOTAL             0
DAYS_BIRTH                   0
DAYDIFF                      0
dtype: int64

In [24]:
hdf.dtypes

SK_ID_CURR                   int64
AMT_GOODS_PRICE            float64
AMT_CREDIT                 float64
AMT_ANNUITY                float64
TARGET                       int64
HOUR_APPR_PROCESS_START      int64
DAYS_EMPLOYED                int64
AMT_INCOME_TOTAL           float64
DAYS_BIRTH                   int64
DAYDIFF                      int64
dtype: object

In [25]:
hdf['AMT_ANNUITY']=hdf['AMT_ANNUITY'].fillna(hdf['AMT_ANNUITY'].mean())
hdf['AMT_GOODS_PRICE']=hdf['AMT_GOODS_PRICE'].fillna(hdf['AMT_GOODS_PRICE'].mean())

In [26]:
descr(hdf)

       SK_ID_CURR  AMT_GOODS_PRICE  AMT_CREDIT  AMT_ANNUITY    TARGET  \
count    252137.0         252137.0    252137.0     252137.0  252137.0
mean     278115.0         549406.0    611398.0      27812.0       0.0
std      102816.0         373079.0    406527.0      14647.0       0.0
min      100002.0          40500.0     45000.0       1980.0       0.0
25%      189035.0         247500.0    277970.0      17073.0       0.0
50%      278064.0         450000.0    521280.0      25834.0       0.0
75%      367165.0         693000.0    829224.0      35618.0       0.0
max      456255.0        4050000.0   4050000.0     258026.0       1.0

       HOUR_APPR_PROCESS_START  DAYS_EMPLOYED  AMT_INCOME_TOTAL  DAYS_BIRTH  \
count                 252137.0       252137.0          252137.0    252137.0
mean                      12.0        -2384.0          175914.0    -14769.0
std                        3.0         2338.0          258852.0      3663.0
min                        0.0       -17912.0           25650.0    -25200.0
25%                       10.0        -3175.0          112500.0    -17563.0
50%                       12.0        -1648.0          157500.0    -14573.0
75%                       15.0         -767.0          211500.0    -11775.0
max                       23.0            0.0       117000000.0     -7489.0

        DAYDIFF
count  252137.0
mean    12385.0
std      3584.0
min      6544.0
25%      9430.0
50%     11952.0
75%     14950.0
max     24897.0

In [27]:
hdf=hdf[hdf['AMT_INCOME_TOTAL']<=2000000]
hdf=hdf[hdf['AMT_CREDIT']<=900000]
hdf=hdf[hdf['AMT_GOODS_PRICE']<=900000]
hdf=hdf[hdf['AMT_ANNUITY']<=35000]

In [28]:
hdf[hdf['DAYS_EMPLOYED']==-17912]

,SK_ID_CURR,AMT_GOODS_PRICE,AMT_CREDIT,AMT_ANNUITY,TARGET,HOUR_APPR_PROCESS_START,DAYS_EMPLOYED,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYDIFF
280994,425566,225000.0,225000.0,21919.5,0,15,-17912,180000.0,-24577,6665

In [29]:
application[application['AMT_CREDIT']==4050000.0]

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
14852,117337,0,Cash loans,M,N,Y,1,760846.5,4050000.0,146002.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
17948,120926,0,Cash loans,M,Y,N,2,783000.0,4050000.0,258025.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
110459,228135,0,Cash loans,M,N,N,2,864900.0,4050000.0,102384.0,...,0,0,0,0,0.0,0.0,0.0,4.0,0.0,0.0
119681,238782,0,Cash loans,M,Y,Y,1,931365.0,4050000.0,102514.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
120757,240007,0,Cash loans,M,N,N,0,587250.0,4050000.0,106969.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
133766,255139,0,Cash loans,F,Y,N,1,1307587.5,4050000.0,100197.0,...,1,0,0,0,0.0,0.0,0.0,0.0,0.0,2.0
287732,433294,0,Cash loans,F,Y,N,1,405000.0,4050000.0,102514.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
288455,434170,0,Cash loans,F,Y,N,1,450000.0,4050000.0,106839.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [30]:
hdf.columns.tolist()

['SK_ID_CURR',
 'AMT_GOODS_PRICE',
 'AMT_CREDIT',
 'AMT_ANNUITY',
 'TARGET',
 'HOUR_APPR_PROCESS_START',
 'DAYS_EMPLOYED',
 'AMT_INCOME_TOTAL',
 'DAYS_BIRTH',
 'DAYDIFF']

In [31]:
# ALEX: remove plotting
# hdf[['AMT_GOODS_PRICE',
#   'AMT_INCOME_TOTAL',
#  'AMT_ANNUITY',
#  'DAYS_EMPLOYED',
#   'DAYS_BIRTH',
#   'AMT_CREDIT',
#  'DAYDIFF']].hist(figsize=(16, 10), bins=50, xlabelsize=8, ylabelsize=8);
hdf[['AMT_GOODS_PRICE',
  'AMT_INCOME_TOTAL',
 'AMT_ANNUITY',
 'DAYS_EMPLOYED',
  'DAYS_BIRTH',
  'AMT_CREDIT',
 'DAYDIFF']]

,AMT_GOODS_PRICE,AMT_INCOME_TOTAL,AMT_ANNUITY,DAYS_EMPLOYED,DAYS_BIRTH,AMT_CREDIT,DAYDIFF
0,351000.0,202500.0,24700.5,-637,-9461,406597.5,8824
2,135000.0,67500.0,6750.0,-225,-19046,135000.0,18821
3,297000.0,135000.0,29686.5,-3039,-19005,312682.5,15966
4,513000.0,121500.0,21865.5,-3038,-19932,513000.0,16894
5,454500.0,99000.0,27517.5,-1588,-16941,490495.5,15353
...,...,...,...,...,...,...,...
307503,247500.0,112500.0,17770.5,-399,-11870,345510.0,11471
307504,225000.0,153000.0,16096.5,-7258,-16705,331920.0,9447
307506,225000.0,157500.0,27558.0,-236,-9327,254700.0,9091
307508,585000.0,153000.0,29979.0,-7921,-14966,677664.0,7045
307509,319500.0,171000.0,20205.0,-4786,-11961,370107.0,7175

In [32]:
correlation = hdf[['AMT_GOODS_PRICE',
  'AMT_INCOME_TOTAL',
 'AMT_ANNUITY',
 'DAYS_EMPLOYED',
  'DAYS_BIRTH',
  'AMT_CREDIT',
 'DAYDIFF']].corr()
# ALEX: remove plotting
# plt.figure(figsize=(7,7))
# flatui = ["#9b59b6", "#3498db", "#95a5a6", "#e74c3c", "#34495e", "#2ecc71"]
# sns.heatmap(correlation, vmax=1, square=True,annot=True,cmap=flatui)
# plt.title('Correlation between different fearures')

In [33]:
# ALEX: remove ML code
# from sklearn.preprocessing import Normalizer
# normalized_application = Normalizer().fit_transform(hdf[['AMT_GOODS_PRICE','AMT_INCOME_TOTAL','AMT_ANNUITY','AMT_CREDIT','DAYDIFF']])
#print (normalized_application)
normalized_application = hdf[['AMT_GOODS_PRICE','AMT_INCOME_TOTAL','AMT_ANNUITY','AMT_CREDIT','DAYDIFF']]
correlation=pd.DataFrame(normalized_application).corr()
correlation.columns=['AMT_GOODS_PRICE','AMT_INCOME_TOTAL','AMT_ANNUITY','AMT_CREDIT','DAYDIFF']
# ALEX: remove plotting
# plt.figure(figsize=(8,8))
# flatui = ["#9b59b6", "#3498db", "#95a5a6", "#e74c3c", "#34495e", "#2ecc71"]
# sns.heatmap(correlation, vmax=1, square=True,annot=True,cmap=flatui)
# plt.title('Correlation between different fearures')

In [34]:
from numpy import log

In [35]:
hdf.head(2)

,SK_ID_CURR,AMT_GOODS_PRICE,AMT_CREDIT,AMT_ANNUITY,TARGET,HOUR_APPR_PROCESS_START,DAYS_EMPLOYED,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYDIFF
0,100002,351000.0,406597.5,24700.5,1,10,-637,202500.0,-9461,8824
2,100004,135000.0,135000.0,6750.0,0,9,-225,67500.0,-19046,18821

In [36]:
hd=hdf.copy()
hd['AMT_INCOME_TOTAL_log']=log(hdf['AMT_INCOME_TOTAL'])

In [37]:
hd.head(2)

,SK_ID_CURR,AMT_GOODS_PRICE,AMT_CREDIT,AMT_ANNUITY,TARGET,HOUR_APPR_PROCESS_START,DAYS_EMPLOYED,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYDIFF,AMT_INCOME_TOTAL_log
0,100002,351000.0,406597.5,24700.5,1,10,-637,202500.0,-9461,8824,12.218495
2,100004,135000.0,135000.0,6750.0,0,9,-225,67500.0,-19046,18821,11.119883

In [38]:
# ALEX: remove plotting
# hd[['AMT_GOODS_PRICE',
#   'AMT_INCOME_TOTAL_log',
#  'AMT_ANNUITY',
#   'AMT_CREDIT',
#  'DAYDIFF']].hist(figsize=(16, 10), bins=50, xlabelsize=8, ylabelsize=8);
hd[['AMT_GOODS_PRICE',
  'AMT_INCOME_TOTAL_log',
 'AMT_ANNUITY',
  'AMT_CREDIT',
 'DAYDIFF']]

,AMT_GOODS_PRICE,AMT_INCOME_TOTAL_log,AMT_ANNUITY,AMT_CREDIT,DAYDIFF
0,351000.0,12.218495,24700.5,406597.5,8824
2,135000.0,11.119883,6750.0,135000.0,18821
3,297000.0,11.813030,29686.5,312682.5,15966
4,513000.0,11.707670,21865.5,513000.0,16894
5,454500.0,11.502875,27517.5,490495.5,15353
...,...,...,...,...,...
307503,247500.0,11.630709,17770.5,345510.0,11471
307504,225000.0,11.938193,16096.5,331920.0,9447
307506,225000.0,11.967181,27558.0,254700.0,9091
307508,585000.0,11.938193,29979.0,677664.0,7045
307509,319500.0,12.049419,20205.0,370107.0,7175

In [39]:
# ALEX: remove ML code
# from sklearn.preprocessing import Normalizer
# normalized_application = Normalizer().fit_transform(hd[['AMT_GOODS_PRICE',
#   'AMT_INCOME_TOTAL_log',
#  'AMT_ANNUITY',
#   'AMT_CREDIT',
#  'DAYDIFF']])
normalized_application = hd[['AMT_GOODS_PRICE',
  'AMT_INCOME_TOTAL_log',
 'AMT_ANNUITY',
  'AMT_CREDIT',
 'DAYDIFF']]
#print (normalized_application)
correlation=pd.DataFrame(normalized_application).corr()
correlation.columns=['AMT_GOODS_PRICE',
  'AMT_INCOME_TOTAL_log',
 'AMT_ANNUITY',
  'AMT_CREDIT',
 'DAYDIFF']
# ALEX: remove plotting
# plt.figure(figsize=(8,8))
# flatui = ["#9b59b6", "#3498db", "#95a5a6", "#e74c3c", "#34495e", "#2ecc71"]
# sns.heatmap(correlation, vmax=1, square=True,annot=True,cmap=flatui)
# plt.title('Correlation between different fearures')

In [40]:
# ALEX: remove plotting
# plt.scatter(hd['AMT_ANNUITY'],hd['AMT_CREDIT'])
# plt.xlabel("amt annuity")
# plt.ylabel("amt credit")
_ = hd['AMT_ANNUITY']
_ = hd['AMT_CREDIT']

In [41]:
# ALEX: remove plotting
# plt.scatter(hd['AMT_GOODS_PRICE'],hd['DAYDIFF'])
# plt.xlabel("amt good")
# plt.ylabel("amt credit")
_ = hd['AMT_GOODS_PRICE']
_ = hd['DAYDIFF']

In [42]:
hd.dtypes

SK_ID_CURR                   int64
AMT_GOODS_PRICE            float64
AMT_CREDIT                 float64
AMT_ANNUITY                float64
TARGET                       int64
HOUR_APPR_PROCESS_START      int64
DAYS_EMPLOYED                int64
AMT_INCOME_TOTAL           float64
DAYS_BIRTH                   int64
DAYDIFF                      int64
AMT_INCOME_TOTAL_log       float64
dtype: object

In [43]:
hd.columns.tolist()

['SK_ID_CURR',
 'AMT_GOODS_PRICE',
 'AMT_CREDIT',
 'AMT_ANNUITY',
 'TARGET',
 'HOUR_APPR_PROCESS_START',
 'DAYS_EMPLOYED',
 'AMT_INCOME_TOTAL',
 'DAYS_BIRTH',
 'DAYDIFF',
 'AMT_INCOME_TOTAL_log']

In [44]:
hd=hd[['SK_ID_CURR',
 'AMT_GOODS_PRICE',
 'DAYS_EMPLOYED',
 'TARGET',
 'AMT_CREDIT',
 'DAYS_BIRTH',
 'AMT_ANNUITY',
 'HOUR_APPR_PROCESS_START',
 'DAYDIFF',
 'AMT_INCOME_TOTAL_log']]

hd.to_csv("tt.csv",index=False)

In [45]:
hd.shape

(172694, 10)

In [46]:
hd.isna().sum()

SK_ID_CURR                 0
AMT_GOODS_PRICE            0
DAYS_EMPLOYED              0
TARGET                     0
AMT_CREDIT                 0
DAYS_BIRTH                 0
AMT_ANNUITY                0
HOUR_APPR_PROCESS_START    0
DAYDIFF                    0
AMT_INCOME_TOTAL_log       0
dtype: int64

In [47]:
ldf.isna().sum()

DAYS_ID_PUBLISH                      0
LIVINGAREA_MODE                 125913
LIVINGAREA_MEDI                 125913
FLAG_DOCUMENT_8                      0
AMT_REQ_CREDIT_BUREAU_WEEK       33856
                                 ...
OBS_60_CNT_SOCIAL_CIRCLE           849
FLAG_DOCUMENT_21                     0
YEARS_BEGINEXPLUATATION_MODE    122341
REGION_RATING_CLIENT                 0
FLAG_DOCUMENT_5                      0
Length: 62, dtype: int64

In [48]:
appobj=application[application_object_columns]

In [49]:
appobj.head(2)

,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,NAME_TYPE_SUITE,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,OCCUPATION_TYPE,WEEKDAY_APPR_PROCESS_START,ORGANIZATION_TYPE,FONDKAPREMONT_MODE,HOUSETYPE_MODE,WALLSMATERIAL_MODE,EMERGENCYSTATE_MODE
0,Cash loans,M,N,Y,Unaccompanied,Working,Secondary / secondary special,Single / not married,House / apartment,Laborers,WEDNESDAY,Business Entity Type 3,reg oper account,block of flats,"Stone, brick",No
1,Cash loans,F,N,N,Family,State servant,Higher education,Married,House / apartment,Core staff,MONDAY,School,reg oper account,block of flats,Block,No

In [50]:
appobj.isna().sum()

NAME_CONTRACT_TYPE                 0
CODE_GENDER                        0
FLAG_OWN_CAR                       0
FLAG_OWN_REALTY                    0
NAME_TYPE_SUITE                 1292
NAME_INCOME_TYPE                   0
NAME_EDUCATION_TYPE                0
NAME_FAMILY_STATUS                 0
NAME_HOUSING_TYPE                  0
OCCUPATION_TYPE                96391
WEEKDAY_APPR_PROCESS_START         0
ORGANIZATION_TYPE                  0
FONDKAPREMONT_MODE            210295
HOUSETYPE_MODE                154297
WALLSMATERIAL_MODE            156341
EMERGENCYSTATE_MODE           145755
dtype: int64